{
  "warmup": [
    {
      "src": "images/image01.png",
      "description": "Child’s Pose (Balasana): Sit back on your heels and stretch your arms forward to warm up your spine and hips."
    },
    {
      "src": "images/image02.png",
      "description": "Cat-Cow Pose (Marjaryasana-Bitilasana): Alternate between arching and rounding your back to sync breath with movement."
    },
    {
      "src": "images/image03.png",
      "description": "Sun Salutations (Surya Namaskar): A dynamic flow that energizes your body."
    },
    {
      "src": "images/image04.png",
      "description": "Standing Side Stretch: Lengthen your spine and sides by gently bending side-to-side."
    },
    {
      "src": "images/image05.png",
      "description": "Neck Rolls: Release tension in your neck with slow, gentle rolls."
    }
  ],
  "coreFlow": [
    {
      "src": "images/image06.png",
      "description": "Warrior II (Virabhadrasana II): Strengthen your legs and improve focus."
    },
    {
      "src": "images/image07.png",
      "description": "Triangle Pose (Trikonasana): Stretch your hips and hamstrings with an open chest."
    },
    {
      "src": "images/image08.png",
      "description": "Chair Pose (Utkatasana): Build strength in your legs and core in this semi-squat position."
    },
    {
      "src": "images/image09.png",
      "description": "Plank to Side Plank: Alternate between a regular plank and side planks to strengthen your core."
    },
    {
      "src": "images/image10.png",
      "description": "Low Lunge to Crescent Lunge: Stretch your hips and engage your legs."
    },
    {
      "src": "images/image11.png",
      "description": "Tree Pose (Vrikshasana): Improve balance and focus by standing on one leg."
    },
    {
      "src": "images/image12.png",
      "description": "Downward Dog to Upward Dog: Alternate these poses to build strength and flexibility."
    }
  ],
  "coolDown": [
    {
      "src": "images/image13.png",
      "description": "Seated Forward Bend (Paschimottanasana): Stretch your hamstrings and relax your back."
    },
    {
      "src": "images/image14.png",
      "description": "Supine Spinal Twist (Supta Matsyendrasana): Release tension in your lower back with this gentle twist."
    },
    {
      "src": "images/image15.png",
      "description": "Happy Baby Pose (Ananda Balasana): Loosen your hips while lying on your back."
    },
    {
      "src": "images/image16.png",
      "description": "Savasana (Corpse Pose): Relax completely and absorb the benefits of your practice."
    }
  ]
}
